[
    {
        "_id": "600a79108d8b81882b374643",
        "Title": "Silence of the Lambs",
        "Description": "A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.",
        "Genre": {
            "Name": "Thriller",
            "Description": "Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."
        },
        "Director": {
            "Name": "Jonathan Demme",
            "Bio": "Robert Jonathan Demme was an American director, producer, and screenwriter.",
            "Birth": "1944",
            "Death": "2017"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BNjNhZTk0ZmEtNjJhMi00YzFlLWE1MmEtYzM1M2ZmMGMwMTU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "Featured": true
    },
    {
        "_id": "600a79108d8b81882b374644",
        "Title": "300",
        "Description": "King Leonidas of Sparta and a force of 300 men fight the Persians at Thermopylae in 480 B.C. ",
        "Genre": {
            "Name": "Action",
            "Description": "Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."
        },
        "Director": {
            "Name": "Zack Snyder",
            "Bio": "Zachary Edward Snyder is an American film director, film producer, and screenwriter, best known for action and science fiction films. Snyder made his feature film debut with the 2004 remake Dawn of the Dead and has gone on to be known for his comic book movies and superhero films,",
            "Birth": "1966",
            "Death": null
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BNWMxYTZlOTUtZDExMi00YzZmLTkwYTMtZmM2MmRjZmQ3OGY4XkEyXkFqcGdeQXVyMTAwMzUyMzUy._V1_UX182_CR0,0,182,268_AL_.jpg",
        "Featured": true
    },
    {
        "_id": "600a79118d8b81882b374645",
        "Title": "Fight Club",
        "Description": "An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into something much, much more.",
        "Genre": {
            "Name": "Drama",
            "Description": "In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."
        },
        "Director": {
            "Name": "David Fincher",
            "Bio": "David Fincher was born in 1962 in Denver, Colorado, and was raised in Marin County, California. When he was 18 years old he went to work for John Korty at Korty Films in Mill Valley. ",
            "Birth": "1962",
            "Death": null
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BMmEzNTkxYjQtZTc0MC00YTVjLTg5ZTEtZWMwOWVlYzY0NWIwXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "Featured": true
    },
    {
        "_id": "600a79118d8b81882b374646",
        "Title": "The Animatrix",
        "Description": "A collection of nine short films featuring stories related to The Matrix saga.",
        "Genre": {
            "Name": "Sci-Fi",
            "Description": "Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."
        },
        "Director": {
            "Name": "Peter Chung",
            "Bio": "Peter Chung is a Korean American animator. He is best known for his unique style of animation, as the creator and director of Æon Flux and Reign: The Conqueror (Alexander Senki).",
            "Birth": "1961"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BZDEwMGYxNjEtNTE3ZC00Zjg3LThlODMtODVhNzBiMTQ3NGI5XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a79118d8b81882b374647",
        "Title": "Akira",
        "Description": "A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psychic psychopath who can only be stopped by two teenagers and a group of psychics.",
        "Genre": {
            "Name": "Sci-Fi",
            "Description": "Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."
        },
        "Director": {
            "Name": "Katsuhiro Otomo",
            "Bio": "Katsuhiro Otomo is a Japanese manga artist, screenwriter, animator and film director. He is best known as the creator of the manga and anime franchise Akira, including the original 1982 manga series and the 1988 animated film adaptation.",
            "Birth": "1954"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BM2ZiZTk1ODgtMTZkNS00NTYxLWIxZTUtNWExZGYwZTRjODViXkEyXkFqcGdeQXVyMTE2MzA3MDM@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a79118d8b81882b374648",
        "Title": "Hook",
        "Description": "When Captain James Hook kidnaps his children, an adult Peter Pan must return to Neverland and reclaim his youthful spirit in order to challenge his old enemy. ",
        "Genre": {
            "Name": "Adventure",
            "Description": "Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in adventure films, sometimes as big as the characters themselves."
        },
        "Director": {
            "Name": "Steven Spielberg",
            "Bio": "One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. He has an extraordinary number of commercially successful and critically acclaimed credits to his name, either as a director, producer or writer since launching the summer blockbuster with Jaws (1975), and he has done more to define popular film-making since the mid-1970s than anyone else.",
            "Birth": "1946"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BNmJjNTQzMjctMmE2NS00ZmYxLWE1NjYtYmRmNjNiMzljOTc3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a79128d8b81882b374649",
        "Title": "Man of Steel",
        "Description": "An alien child is evacuated from his dying world and sent to Earth to live among humans. His peace is threatened, when other survivors of his home planet invade Earth. ",
        "Genre": {
            "Name": "Action",
            "Description": "Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."
        },
        "Director": {
            "Name": "Zack Snyder",
            "Bio": "Zachary Edward Snyder is an American film director, film producer, and screenwriter, best known for action and science fiction films. Snyder made his feature film debut with the 2004 remake Dawn of the Dead and has gone on to be known for his comic book movies and superhero films,",
            "Birth": "1966"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BMTk5ODk1NDkxMF5BMl5BanBnXkFtZTcwNTA5OTY0OQ@@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a79128d8b81882b37464a",
        "Title": "Ready Player One",
        "Description": "When the creator of a virtual reality called the OASIS dies, he makes a posthumous challenge to all OASIS users to find his Easter Egg, which will give the finder his fortune and control of his world. ",
        "Genre": {
            "Name": "Sci-Fi",
            "Description": "Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."
        },
        "Director": {
            "Name": "Steven Spielberg",
            "Bio": "One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. He has an extraordinary number of commercially successful and critically acclaimed credits to his name, either as a director, producer or writer since launching the summer blockbuster with Jaws (1975), and he has done more to define popular film-making since the mid-1970s than anyone else.",
            "Birth": "1946"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BY2JiYTNmZTctYTQ1OC00YjU4LWEwMjYtZjkwY2Y5MDI0OTU3XkEyXkFqcGdeQXVyNTI4MzE4MDU@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a79138d8b81882b37464b",
        "Title": "Field of Dreams",
        "Description": "Iowa farmer Ray Kinsella is inspired by a voice he can't ignore to pursue a dream he can hardly believe. Supported by his wife, Ray begins the quest by turning his ordinary cornfield into a place where dreams can come true. ",
        "Genre": {
            "Name": "Family",
            "Description": "A children's film, or family film, is a film genre that contains children or relates to them in the context of home and family. Children's films are made specifically for children and not necessarily for the general audience, while family films are made for a wider appeal with a general audience in mind."
        },
        "Director": {
            "Name": " Phil Alden Robinson ",
            "Bio": "Phil Alden Robinson was born in Long Beach, Long Island, New York, USA. He is a writer and director, known for Field of Dreams (1989), Sneakers (1992) and The Sum of All Fears (2002). He has been married to Paulette Bartlett since September 26, 2009.",
            "Birth": "1950"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BNzk5OWY0YjAtYWU3ZS00Y2Q4LWFlNjItMzgwMTQ2MjIyMDFmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a79138d8b81882b37464c",
        "Title": "Carlito's Way",
        "Description": "A Puerto Rican former convict, just released from prison, pledges to stay away from drugs and violence despite the pressure around him and lead on to a better life outside of New York City",
        "Genre": {
            "Name": "Crime",
            "Description": "Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."
        },
        "Director": {
            "Name": "Brian De Palma",
            "Bio": "Brian De Palma is the son of a surgeon. He studied physics but at the same time felt his dedication for the movies and made some short films. After seven independent productions he had his first success with Sisters (1972) and his voyeuristic style. Restlessly he worked on big projects with the script writers Paul Schrader, John Farris and Oliver Stone. He also filmed a novel of Stephen King: Carrie (1976). Another important film was The Untouchables (1987) with a script by David Mamet adapted from the TV series.",
            "Birth": "1940"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BN2I2N2Q1YmMtMzZkMC00Y2JjLWJmOWUtNjc2OTM2ZTk1MjUyXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a97a197990539f4b364b2",
        "Title": "Django Unchained",
        "Description": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner",
        "Genre": {
            "Name": "Western",
            "Description": "Stories in the Western genre are set in the American West, between the time of the Civil war and the early twentieth century. The setting of a wilderness or uncivilized area is especially important to the genre, and the setting is often described richly and in-depth. They focus on the adventure of the main character(s) and the contrast between civilization or society and the untamed wilderness, often featuring the characters working to bring civilization to the wilderness"
        },
        "Director": {
            "Name": "Quentin Tarantino",
            "Bio": "Quentin Jerome Tarantino was born in Knoxville, Tennessee. His father, Tony Tarantino, is an Italian-American actor and musician from New York, and his mother, Connie (McHugh), is a nurse from Tennessee. Quentin moved with his mother to Torrance, California, when he was four years old.",
            "Birth": "1963"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a97a597990539f4b364b3",
        "Title": "Romeo + Juliet",
        "Description": "Shakespeare's famous play is updated to the hip modern suburb of Verona still retaining its original dialogue.",
        "Genre": {
            "Name": "Drama",
            "Description": "In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone. Drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre, such as soap opera (operatic drama), police crime drama, political drama, legal drama, historical drama, domestic drama, teen drama, and comedy-drama (dramedy). These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods. "
        },
        "Director": {
            "Name": "Baz Luhrmann",
            "Bio": "Baz Luhrmann is an Australian writer, director, and producer with projects spanning film, television, opera, theatre, music, and recording industries. He is regarded by many as a contemporary example of an auteur for his distinctly recognizable style and deep involvement in the writing, directing, design, and musical components of all his work.",
            "Birth": "1962"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BMGU4YmI1ZGQtZjExYi00M2E0LTgyYTAtNzQ5ZmVlMTk4NzUzXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a97a797990539f4b364b4",
        "Title": "2001: A Space Odyssey",
        "Description": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000.",
        "Genre": {
            "Name": "Sci-Fi",
            "Description": "Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."
        },
        "Director": {
            "Name": "Stanley Kubrick",
            "Bio": "Stanley Kubrick was an American film director, producer, screenwriter, and photographer. He is frequently cited as one of the greatest filmmakers in cinematic history. His films, which are mostly adaptations of novels or short stories, cover a wide range of genres, and are noted for their realism, dark humor, unique cinematography, extensive set designs, and evocative use of music.",
            "Birth": "1928",
            "Death": "1999"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BMmNlYzRiNDctZWNhMi00MzI4LThkZTctMTUzMmZkMmFmNThmXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX182_CR0,0,182,268_AL_.jpg"
    },
    {
        "_id": "600a97ac97990539f4b364b5",
        "Title": "The Godfather",
        "Description": "An organized crime dynasty's aging patriarch transfers control of his clandestine empire to his reluctant son.",
        "Genre": {
            "Name": "Crime",
            "Description": "Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."
        },
        "Director": {
            "Name": "Francis Ford Coppola",
            "Bio": "Francis Ford Coppola is an American film director, producer and screenwriter. He was a central figure in the New Hollywood filmmaking movement of the 1960s and 1970s, and is widely considered to be one of the greatest filmmakers of all time.[5] His accolades include five Academy Awards, six Golden Globe Awards, two Palmes d'Or, and a British Academy Film Award.",
            "Birth": "1939"
        },
        "ImagePath": "https: //m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UY268_CR3,0,182,268_AL_.jpg",
        "Featured": true
    }
]